#-*- coding:utf-8 -*-
###주작업,부수작업,작업여유 자동분류, 간단한 데이터 산정 및 그래프 작성하는 프로그램###
import openpyxl, os
from openpyxl.styles import Alignment, Font, Border, Side, PatternFill
from openpyxl.chart import BarChart, PieChart, Series, Reference
from openpyxl.chart.label import DataLabelList
from openpyxl.worksheet.datavalidation import DataValidation
from os import listdir
fill_LightOrange,fill_LightBlue,fill_LightGreen,fill_LightYellow=PatternFill("solid",fgColor="FCE4D6"),PatternFill("solid",fgColor="D9E1F2"),PatternFill("solid",fgColor="E2EFDA"),PatternFill("solid",fgColor="FCFCD6")
my_font,black_bold=Font(bold=True,color="FFFFFF"),Font(bold=True,color="000000")
thin_border=Border(left=Side(border_style="thin", color="000000"),right=Side(border_style="thin", color="000000"),top=Side(border_style="thin", color="000000"),bottom=Side(border_style="thin", color="000000"))
centered_A=Alignment(horizontal='center',vertical='center')
OCPjobdict={
'강덕원': '팀장', '성기현': '위험/실사관리', '신동현': '위험/실사관리', '우진선': '위험/실사관리', '임하윤': '위험/실사관리', '연대훈': '위험/실사관리', '권영아': '팀장', '서유림': 'QM운영', '한규동': 'QM운영', '최원찬': '팀장', '김누리': 'QC운영관리', '김영미': 'QC운영', '김영빈': '시험관리', '김재영': 'QC운영', '김주영': 'QC운영', '김지혜': 'QC운영', '남성식': 'QC운영', '박승민': 'QC운영관리', '서성재': '시험', '송기원': '시험', '오선영': 'QC운영', '용종만': 'QC운영관리', '원성연': '시험', '임정현': 'QC운영', '장민지': 'QC운영', '조민주': '시험', '최형규': 'QC운영관리', '하병헌': '시험', '한인호': '시험', '허웅': 'QC운영관리', '강완용': '시험', '고희승': '시험', '김소희': '시험', '김은지': '시험관리', '김지철': '시험', '김지한': '시험관리', '김진영': '시험관리', '김한기': '시험', '김희동': '시험', '류민영': '시험관리', '박웅기': '시험', '박윤상': '시험관리', '방소희': '시험관리', '배준모': '시험관리', '신동우': '시험관리', '연규민': '시험', '우성민': '시험', '유희성': '시험관리', '윤영욱': '시험', '윤채정': '시험', '이진국': '시험', '이진희': '시험', '장푸름': '시험관리', '조승연': '시험', '조현경': '시험관리', '최가연': '시험', '편혜림': '시험', '홍성만': '시험', '김광식': '시험', '김나영': '시험', '김동완': '시험', '김왕규': '시험', '김은선': '시험관리', '나혜정': '시험', '노미정': '시험', '박상범': '시험관리', '박지영': '시험', '방봉준': '시험관리', '신예지': '시험관리', '위수경': '시험', '유기혁': '시험', '윤정화': '시험', '이성진': '시험관리', '이수동': '시험', '이혜영': '시험', '정태현': '시험', '최지은': '시험', '한도단': '시험', '한종필': '시험', '한지현': '시험', '홍명환': '시험', '최은아': '시험관리', '김진규': '시험실관리', '오일영': '시험', '유경식': '시험', '장석원': '시험', '김치현': '시험', '정동주': '시험', '지원태': '시험', '이선희': '시험', '권지영': '시험', '선종흠': '시험', '이민영': '시험', '이범찬': '시험', '이아라': '시험', '장지혜': '시험관리', '정경원': '시험', '정진홍': '시험', '최윤선': '시험관리', '함재호': '시험', '곽민성': '시험실관리', '김수혁': '시험관리', '김정곤': '시험', '김준용': '시험', '박상협': '시험', '박진희': '시험', '안시후': '시험', '이예람': '시험', '이은지': '시험관리', '정다인': '시험', '홍성주': '시험', '박천보': '팀장', '박성진': '문서관리', '김아람': 'GMP교육관리', '김락영': '문서관리', '김민기': '문서관리', '홍근형': 'QA시스템운영', '김송이': '문서관리', '이광호': '문서관리', '양재연': '문서관리', '김상미': 'QA시스템운영', '홍승현': '물류보증', '권민재': '물류보증', '신지현': '원자재보증', '안창규': '원자재보증', '이미지': '원자재보증', '김혜연': '물류보증책임자', '우대균': '원자재보증', '이태훈': '물류보증', '정진석': '원자재보증', '이우미': '원자재보증', '유서영': '원자재보증', '최윤호': '원자재보증', '이정훈': '원자재보증', '이하늘': '원자재보증', '최정민': '원자재보증', '박동일': '팀장', '김종경': '품질부서책임', '김나연': '제품품질보증', '박원호': '제품품질보증', '이제관': '제품품질보증', '이선주': '국가출하', '황종미': '국가출하', '이지영': '제품품질보증', '박현아': '제품품질보증', '김재희': '제품품질보증', '서영란': '제품품질보증', '이세준': '제품품질보증', '이현호': '제품품질보증', '이유경': '제품품질보증', '임재혁': '제품품질보증', '김남식': '제품품질보증', '송수연': '제품품질보증', '김민주': '제품품질보증', '이근희': '제품품질보증', '김현': '품질부서책임', '김웅희': '제품품질보증', '박희우': '품질부서책임', '강기적': '제품품질보증', '이동경': '제품품질보증', '신재훈': '제품품질보증', '이나라': '제품품질보증', '정다운': '제품품질보증', '허성호': '제품품질보증', '박세윤': '제품품질보증', '서재황': '품질부서책임', '이성구': '제품품질보증', '박선이': '제품품질보증', '김선진': '제품품질보증', '김상욱': '시험실보증관리', '조윤식': '시험실보증관리', '유화정': '시험실보증관리', '윤석빈': '시험실보증관리', '이경명': '팀장', '김상훈': 'H/W, S/W 보증', '강석현': 'H/W, S/W 보증', '손혁': 'H/W, S/W 보증', '지윤석': 'H/W, S/W 보증', '이지원': 'H/W, S/W 보증', '김낙우': 'H/W, S/W 보증', '김수민': 'H/W, S/W 보증', '김다연': 'H/W, S/W 보증', '차승욱': 'H/W, S/W 보증', '김하연': 'H/W, S/W 보증', '김효진': 'H/W, S/W 보증', '강창헌': '밸리데이션보증', '최지민': '밸리데이션보증', '한아름': '밸리데이션보증', '민혜정': '밸리데이션보증', '김준호': '밸리데이션보증', '조소현': '밸리데이션보증'}
OCPsexdict={
'강덕원': '남', '성기현': '남', '신동현': '남', '우진선': '여', '임하윤': '여', '연대훈': '남', '권영아': '여', '서유림': '남', '한규동': '남', '최원찬': '남', '김누리': '여', '김영미': '여', '김영빈': '남', '김재영': '남', '김주영': '남', '김지혜': '여', '남성식': '남', '박승민': '남', '서성재': '남', '송기원': '남', '오선영': '여', '용종만': '남', '원성연': '남', '임정현': '남', '장민지': '여', '조민주': '여', '최형규': '남', '하병헌': '남', '한인호': '남', '허웅': '남', '강완용': '남', '고희승': '남', '김소희': '여', '김은지': '여', '김지철': '남', '김지한': '남', '김진영': '여', '김한기': '남', '김희동': '남', '류민영': '여', '박웅기': '남', '박윤상': '남', '방소희': '여', '배준모': '남', '신동우': '남', '연규민': '남', '우성민': '남', '유희성': '남', '윤영욱': '남', '윤채정': '여', '이진국': '남', '이진희': '여', '장푸름': '여', '조승연': '여', '조현경': '여', '최가연': '여', '편혜림': '여', '홍성만': '남', '김광식': '남', '김나영': '여', '김동완': '남', '김왕규': '남', '김은선': '여', '나혜정': '여', '노미정': '여', '박상범': '남', '박지영': '여', '방봉준': '남', '신예지': '여', '위수경': '여', '유기혁': '남', '윤정화': '여', '이성진': '남', '이수동': '남', '이혜영': '여', '정태현': '남', '최지은': '여', '한도단': '남', '한종필': '남', '한지현': '여', '홍명환': '남', '최은아': '여', '김진규': '남', '오일영': '남', '유경식': '남', '장석원': '남', '김치현': '남', '정동주': '남', '지원태': '남', '이선희': '여', '권지영': '여', '선종흠': '남', '이민영': '여', '이범찬': '남', '이아라': '여', '장지혜': '여', '정경원': '남', '정진홍': '남', '최윤선': '여', '함재호': '남', '곽민성': '남', '김수혁': '남', '김정곤': '남', '김준용': '남', '박상협': '남', '박진희': '여', '안시후': '남', '이예람': '여', '이은지': '여', '정다인': '여', '홍성주': '남', '박천보': '남', '박성진': '남', '김아람': '여', '김락영': '남', '김민기': '남', '홍근형': '남', '김송이': '여', '이광호': '남', '양재연': '여', '김상미': '여', '홍승현': '남', '권민재': '남', '신지현': '여', '안창규': '남', '이미지': '여', '김혜연': '여', '우대균': '남', '이태훈': '남', '정진석': '남', '이우미': '여', '유서영': '여', '최윤호': '남', '이정훈': '남', '이하늘': '여', '최정민': '여', '박동일': '남', '김종경': '남', '김나연': '여', '박원호': '남', '이제관': '남', '이선주': '여', '황종미': '여', '이지영': '여', '박현아': '여', '김재희': '남', '서영란': '여', '이세준': '남', '이현호': '남', '이유경': '여', '임재혁': '남', '김남식': '남', '송수연': '여', '김민주': '여', '이근희': '남', '김현': '남', '김웅희': '남', '박희우': '여', '강기적': '남', '이동경': '남', '신재훈': '남', '이나라': '여', '정다운': '여', '허성호': '남', '박세윤': '남', '서재황': '남', '이성구': '남', '박선이': '여', '김선진': '남', '김상욱': '남', '조윤식': '남', '유화정': '여', '윤석빈': '남', '이경명': '남', '김상훈': '남', '강석현': '남', '손혁': '남', '지윤석': '남', '이지원': '여', '김낙우': '남', '김수민': '여', '김다연': '여', '차승욱': '남', '김하연': '여', '김효진': '여', '강창헌': '남', '최지민': '남', '한아름': '여', '민혜정': '여', '김준호': '남', '조소현': '여'}
HSPjobdict={
'홍성구': '팀장', '김동옥': 'QC운영관리', '박지영': 'QC운영', '배상철': '시험', '황규정': '시험', '강진규': 'QC운영관리', '조윤현': 'QC운영', '양훈식': '시험', '이수': '시험', '최장수': '시험', '김산하': 'QC운영', '송승형': '시험', '안초롱': 'QC운영', '신나라': '시험', '우승빈': '시험', '정승기': '시험', '최재욱': '시험', '황유철': '시험', '유지연': '시험', '박순원': 'QC운영', '박병욱': 'QC운영', '장민혁': '시험', '박재섭': 'QC운영관리', '김민정': 'QC운영', '김인권': '시험', '박소희': 'QC운영', '김민': '시험', '정인규': '시험', '성유림': 'QC운영', '손보아': '시험', '이미지': '시험', '이용진': '시험', '정선혜': 'QC운영', '한지은': '시험', '강동우': 'QC운영', '손동혁': 'QC운영', '윤한솔': '시험', '이경훈': 'QC운영', '손정진': 'QC운영', '정우성': 'QC운영', '김두희': 'QC운영', '김정은': 'QC운영', '이중진': '시험', '윤채희': 'QC운영', '이도엽': 'QC운영', '홍재우': '시험', '박다현': 'QC운영', '이인규': '팀장', '성희진': '시험실보증관리', '최재유': 'GMP교육관리', '이은비': '실사관리', '강성국': '품질부서책임', '김초원': '실사관리', '채규탁': '문서관리', '김민섭': '제품품질보증', '신명래': '제품품질보증', '정수현': '문서관리', '채수연': '제품품질보증', '김치화': '품질부서책임', '박민정': '제품품질보증', '주정현': '제품품질보증', '박지민': '제품품질보증', '최준호': '제품품질보증', '김정일': 'H/W, S/W 보증', '김환식': 'H/W, S/W 보증', '염규민': 'H/W, S/W 보증', '이은교': '밸리데이션보증', '강지빈': 'H/W, S/W 보증', '성원엽': 'H/W, S/W 보증', '한원지': 'H/W, S/W 보증', '박종찬': '밸리데이션보증', '김지수': 'H/W, S/W 보증', '한개은': '제품품질보증', '방진영': '제품품질보증', '송유주': '제품품질보증'}
HSPsexdict={
'홍성구': '남', '김동옥': '남', '박지영': '여', '배상철': '남', '황규정': '남', '강진규': '남', '조윤현': '남', '양훈식': '남', '이수': '남', '최장수': '남', '김산하': '여', '송승형': '남', '안초롱': '여', '신나라': '남', '우승빈': '남', '정승기': '남', '최재욱': '남', '황유철': '남', '유지연': '여', '박순원': '남', '박병욱': '남', '장민혁': '남', '박재섭': '남', '김민정': '여', '김인권': '남', '박소희': '여', '김민': '남', '정인규': '남', '성유림': '여', '손보아': '여', '이미지': '여', '이용진': '남', '정선혜': '여', '한지은': '여', '강동우': '남', '손동혁': '남', '윤한솔': '남', '이경훈': '남', '손정진': '남', '정우성': '남', '김두희': '남', '김정은': '여', '이중진': '남', '윤채희': '여', '이도엽': '남', '홍재우': '남', '박다현': '여', '이인규': '남', '성희진': '여', '최재유': '남', '이은비': '여', '강성국': '남', '김초원': '여', '채규탁': '남', '김민섭': '남', '신명래': '남', '정수현': '여', '채수연': '여', '김치화': '여', '박민정': '여', '주정현': '남', '박지민': '남', '최준호': '남', '김정일': '남', '김환식': '남', '염규민': '남', '이은교': '여', '강지빈': '여', '성원엽': '남', '한원지': '여', '박종찬': '남', '김지수': '여', '한개은': '남', '방진영': '남', '송유주': '여'}
ESPjobdict={
'김범창': '팀장', '김둘이': 'QC운영관리', '박소희': 'QC운영', '김종숙': '시험', '정주희': '시험', '정영석': '시험', '고의건': '시험', '홍기연': '시험', '김성태': '시험', '윤다예': '시험', '강민지': '시험', '박현순': '시험', '양승호': '시험', '이창훈': '시험', '박성미': '시험', '정재헌': 'QC운영관리', '지은영': '시험', '김세환': '시험', '고시은': '시험', '이강수': '시험', '정다혜': '시험', '홍철기': '시험', '김하빈': '시험', '김승회': 'QC운영관리', '류황민': '시험', '김태훈': '팀장', '김준희': '품질부서책임', '윤형진': '제품품질보증', '서동석': '제품품질보증', '원진석': '제품품질보증', '김승우': '제품품질보증', '정미래': '제품품질보증', '변재연': '제품품질보증', '노도형': '제품품질보증', '손자연': '제품품질보증', '구자준': 'H/W, S/W 보증', '오웅조': 'H/W, S/W 보증', '권보민': 'H/W, S/W 보증', '권봉성': 'H/W, S/W 보증', '박요한': 'H/W, S/W 보증'}
ESPsexdict={
'김범창': '남', '김둘이': '여', '박소희': '여', '김종숙': '여', '정주희': '남', '정영석': '남', '고의건': '남', '홍기연': '여', '김성태': '남', '윤다예': '여', '강민지': '여', '박현순': '여', '양승호': '남', '이창훈': '남', '박성미': '여', '정재헌': '남', '지은영': '여', '김세환': '남', '고시은': '여', '이강수': '남', '정다혜': '여', '홍철기': '남', '김하빈': '남', '김승회': '남', '류황민': '남', '김태훈': '남', '김준희': '남', '윤형진': '남', '서동석': '남', '원진석': '남', '김승우': '남', '정미래': '여', '변재연': '남', '노도형': '남', '손자연': '여', '구자준': '남', '오웅조': '남', '권보민': '남', '권봉성': '남', '박요한': '남'}
OCPlevel={
'강덕원': 'GL5', '성기현': 'GL3', '신동현': 'GL3', '우진선': 'GL2', '임하윤': 'GL1', '연대훈': 'GL1', '권영아': 'GL5', '서유림': 'GL2', '한규동': 'GL1', '최원찬': 'GL5', '김누리': 'GL1', '김영미': 'GL2', '김영빈': 'GL3', '김재영': '촉탁', '김주영': 'GL2', '김지혜': 'GL1', '남성식': 'GL1', '박승민': 'GL2', '서성재': 'GL1', '송기원': 'GL1', '오선영': 'GL1', '용종만': 'GL4', '원성연': 'GL1', '임정현': 'GL2', '장민지': 'GL1', '조민주': 'GL1', '최형규': 'GL1', '하병헌': 'GL1', '한인호': 'GL1', '허웅': 'GL3', '강완용': 'GL2', '고희승': 'GL1', '김소희': 'GL1', '김은지': 'GL1', '김지철': 'GL2', '김지한': 'GL3', '김진영': 'GL5', '김한기': 'GL1', '김희동': 'GL1', '류민영': 'GL2', '박웅기': 'GL1', '박윤상': 'GL1', '방소희': 'GL3', '배준모': 'GL3', '신동우': 'GL1', '연규민': 'GL1', '우성민': 'GL1', '유희성': 'GL1', '윤영욱': 'GL1', '윤채정': 'GL1', '이진국': 'GL2', '이진희': 'GL1', '장푸름': 'GL2', '조승연': '촉탁', '조현경': 'GL2', '최가연': 'GL1', '편혜림': 'GL2', '홍성만': 'GL1', '김광식': 'GL1', '김나영': 'GL1', '김동완': 'GL1', '김왕규': 'GL2', '김은선': 'GL2', '나혜정': 'GL1', '노미정': 'GL1', '박상범': 'GL3', '박지영': 'GL1', '방봉준': 'GL2', '신예지': 'GL2', '위수경': 'GL1', '유기혁': 'GL1', '윤정화': 'GL2', '이성진': 'GL4', '이수동': 'GL1', '이혜영': 'GL3', '정태현': 'GL1', '최지은': 'GL1', '한도단': 'GL1', '한종필': 'GL2', '한지현': 'GL2', '홍명환': 'GL2', '최은아': 'GL5', '김진규': 'GL3', '오일영': 'GL2', '유경식': 'GL2', '장석원': 'GL3', '김치현': 'GL1', '정동주': 'GL1', '지원태': 'GL2', '이선희': 'GL1', '권지영': 'GL2', '선종흠': 'GL3', '이민영': 'GL1', '이범찬': 'GL1', '이아라': 'GL1', '장지혜': 'GL2', '정경원': 'GL2', '정진홍': 'GL1', '최윤선': 'GL3', '함재호': 'GL1', '곽민성': 'GL3', '김수혁': 'GL3', '김정곤': 'GL2', '김준용': 'GL1', '박상협': 'GL1', '박진희': 'GL1', '안시후': 'GL1', '이예람': 'GL1', '이은지': 'GL3', '정다인': 'GL1', '홍성주': 'GL2', '박천보': 'GL5', '박성진': 'GL3', '김아람': 'GL3', '김락영': 'GL3', '김민기': 'GL3', '홍근형': 'GL3', '김송이': 'GL1', '이광호': 'GL1', '양재연': 'GL1', '김상미': '촉탁', '홍승현': 'GL4', '권민재': 'GL4', '신지현': 'GL4', '안창규': 'GL3', '이미지': 'GL3', '김혜연': 'GL3', '우대균': 'GL2', '이태훈': 'GL1', '정진석': 'GL1', '이우미': 'GL1', '유서영': 'GL1', '최윤호': 'GL2', '이정훈': 'GL2', '이하늘': 'GL1', '최정민': 'GL1', '박동일': 'GL5', '김종경': 'GL4', '김나연': 'GL3', '박원호': 'GL3', '이제관': 'GL3', '이선주': 'GL2', '황종미': 'GL3', '이지영': 'GL2', '박현아': 'GL2', '김재희': 'GL1', '서영란': 'GL2', '이세준': 'GL1', '이현호': 'GL1', '이유경': 'GL2', '임재혁': 'GL1', '김남식': 'GL1', '송수연': 'GL1', '김민주': 'GL1', '이근희': 'GL1', '김현': 'GL4', '김웅희': 'GL3', '박희우': 'GL3', '강기적': 'GL3', '이동경': 'GL2', '신재훈': 'GL1', '이나라': 'GL1', '정다운': 'GL1', '허성호': 'GL1', '박세윤': 'GL1', '서재황': 'GL1', '이성구': '촉탁', '박선이': 'GL4', '김선진': '촉탁', '김상욱': 'GL5', '조윤식': 'GL2', '유화정': 'GL1', '윤석빈': 'GL1', '이경명': 'GL5', '김상훈': 'GL3', '강석현': 'GL3', '손혁': 'GL3', '지윤석': 'GL2', '이지원': 'GL2', '김낙우': 'GL3', '김수민': 'GL1', '김다연': 'GL1', '차승욱': 'GL1', '김하연': 'GL1', '김효진': 'GL1', '강창헌': 'GL3', '최지민': 'GL2', '한아름': 'GL1', '민혜정': 'GL1', '김준호': 'GL1', '조소현': 'GL1'}
ESPlevel={
'김범창': 'GL4', '김둘이': 'GL3', '박소희': 'GL2', '김종숙': 'GL2', '정주희': 'GL2', '정영석': 'GL1', '고의건': 'GL2', '홍기연': 'GL2', '김성태': 'GL2', '윤다예': 'GL2', '강민지': 'GL2', '박현순': 'GL1', '양승호': 'GL1', '이창훈': 'GL1', '박성미': 'GL1', '정재헌': 'GL3', '지은영': 'GL2', '김세환': 'GL2', '고시은': 'GL1', '이강수': 'GL1', '정다혜': 'GL1', '홍철기': 'GL1', '김하빈': 'GL1', '김승회': 'GL3', '류황민': 'GL1', '김태훈': 'GL4', '김준희': 'GL4', '윤형진': 'GL3', '서동석': 'GL3', '원진석': 'GL3', '김승우': 'GL1', '정미래': 'GL1', '변재연': '촉탁', '노도형': 'GL2', '손자연': 'GL2', '구자준': 'GL3', '오웅조': 'GL3', '권보민': 'GL2', '권봉성': 'GL2', '박요한': 'GL1'}
HSPlevel={
'홍성구': 'GL5', '김동옥': 'GL3', '박지영': 'GL2', '배상철': 'GL2', '황규정': '촉탁', '강진규': 'GL3', '조윤현': 'GL3', '양훈식': 'GL2', '이수': 'GL2', '최장수': 'GL2', '김산하': 'GL2', '송승형': 'GL2', '안초롱': 'GL2', '신나라': 'GL1', '우승빈': 'GL1', '정승기': 'GL1', '최재욱': 'GL1', '황유철': 'GL1', '유지연': 'GL1', '박순원': 'GL1', '박병욱': 'GL1', '장민혁': '촉탁', '박재섭': 'GL3', '김민정': 'GL3', '김인권': 'GL2', '박소희': 'GL3', '김민': 'GL2', '정인규': 'GL2', '성유림': 'GL2', '손보아': 'GL1', '이미지': 'GL1', '이용진': 'GL1', '정선혜': 'GL1', '한지은': 'GL1', '강동우': 'GL1', '손동혁': 'GL1', '윤한솔': 'GL1', '이경훈': 'GL3', '손정진': 'GL2', '정우성': 'GL3', '김두희': 'GL2', '김정은': 'GL2', '이중진': 'GL1', '윤채희': 'GL1', '이도엽': 'GL1', '홍재우': 'GL1', '박다현': 'GL1', '이인규': 'GL4', '성희진': 'GL3', '최재유': 'GL3', '이은비': 'GL1', '강성국': 'GL4', '김초원': 'GL2', '채규탁': 'GL2', '김민섭': 'GL2', '신명래': 'GL1', '정수현': 'GL1', '채수연': 'GL1', '김치화': 'GL4', '박민정': 'GL3', '주정현': 'GL3', '박지민': 'GL2', '최준호': 'GL1', '김정일': 'GL4', '김환식': 'GL3', '염규민': 'GL2', '이은교': 'GL3', '강지빈': 'GL1', '성원엽': 'GL2', '한원지': 'GL1', '박종찬': 'GL1', '김지수': 'GL1', '한개은': 'GL3', '방진영': 'GL1', '송유주': 'GL1'}
filepath=listdir('.')
cdir=os.path.abspath('.') #현재 디렉토리 주소
partname=cdir[::-1][:cdir[::-1].index("\\")][::-1] #파트명(현재디렉토리 주소 기준)
Plantlst=["OCP","HSP","ESP"]
OCPTeamlst=["GQM","QM지원","QC","QA","QE","QA(compliance)"]
HSPTeamlst=["QA","QC"]
ESPTeamlst=["QA","QC"]
rwb=openpyxl.load_workbook("Z:\\QM직무.xlsx",data_only=True) #"Z:\\QM직무.xlsx"   / "C:\\Users\\User\\Desktop\\QM직무.xlsx"
for files in filepath:
    if ".xlsx" in str(files):
        wb=openpyxl.load_workbook(files) #,data_only=True #데이터 온리를 트루로 하니까 이전에 썼던 sum값도 데이터로 받아옴..
        shlst=wb.sheetnames
        for sht in shlst:
            iws=wb[sht]  #iws.insert_rows(1) #행을 그대로 삽입하므로 안 쓰는 걸 추천한다.
            iws["B1"],iws["D1"],iws["F1"],iws["J1"],iws["N1"],iws["R1"],iws["V1"],iws["Z1"]="소속","공장","팀","파트","이름","성별","Level","직무"
            iws["B1"].fill,iws["D1"].fill,iws["F1"].fill,iws["J1"].fill,iws["N1"].fill,iws["R1"].fill,iws["V1"].fill,iws["Z1"].fill=fill_LightBlue,fill_LightBlue,fill_LightBlue,fill_LightBlue,fill_LightBlue,fill_LightBlue,fill_LightBlue,fill_LightBlue
            iws["C1"],iws["P1"]="QM실",str(sht)
            for i in range(2,29):
                iws.cell(row=1,column=i).border,iws.cell(row=1,column=i).font=thin_border,black_bold
                iws.cell(row=2,column=i).fill=fill_LightOrange
            iws["AA2"],iws["AB2"],iws["AC2"]="비율","평균","표준편차"
            iws["AA2"].font,iws["AB2"].font,iws["AC2"].font=black_bold,black_bold,black_bold
            iws["AA2"].border,iws["AB2"].border,iws["AC2"].border=thin_border,thin_border,thin_border
            iws["AA2"].fill,iws["AB2"].fill,iws["AC2"].fill=fill_LightOrange,fill_LightOrange,fill_LightOrange
            imp=3
            while True:
                imp+=1
                if iws["B"+str(imp)].value=="일별 합계":
                    iws["B"+str(imp)].alignment,iws["B"+str(imp)].fill=centered_A,fill_LightOrange
                    break
            for i in range(3,imp+1):
                iws["AA"+str(i)],iws["AA"+str(i)].number_format,iws["AA"+str(i)].border="=Z"+str(i)+"/Z"+str(imp),"0.0%",thin_border
                iws["AB"+str(i)],iws["AB"+str(i)].number_format,iws["AB"+str(i)].border="=IFERROR(AVERAGE(F"+str(i)+":Y"+str(i)+"),0)","0.0",thin_border
                iws["AC"+str(i)],iws["AC"+str(i)].number_format,iws["AC"+str(i)].border="=IFERROR(STDEVP(F"+str(i)+":Y"+str(i)+"),0)","0.0",thin_border
            iws["B"+str(imp+3)],iws["C"+str(imp+3)],iws["D"+str(imp+3)]="항목","항목별 시간(분)","항목별 비율"
            iws["B"+str(imp+4)],iws["B"+str(imp+5)],iws["B"+str(imp+6)],iws["B"+str(imp+7)]="주작업","부수작업","작업여유","소계"
            iws["C"+str(imp+4)],iws["C"+str(imp+5)],iws["C"+str(imp+6)],iws["C"+str(imp+7)]="=SUMIF(E3:E"+str(imp-1)+',"주작업",Z3:Z'+str(imp-1)+")","=SUMIF(E3:E"+str(imp-1)+',"부수작업",Z3:Z'+str(imp-1)+")","=SUMIF(E3:E"+str(imp-1)+',"작업여유",Z3:Z'+str(imp-1)+")","=SUM(C"+str(imp+4)+":C"+str(imp+6)+")"
            iws["C"+str(imp+4)].number_format,iws["C"+str(imp+5)].number_format,iws["C"+str(imp+6)].number_format,iws["C"+str(imp+7)].number_format="#,##0","#,##0","#,##0","#,##0"
            iws["D"+str(imp+4)],iws["D"+str(imp+5)],iws["D"+str(imp+6)],iws["D"+str(imp+7)]="=C"+str(imp+4)+"/C"+str(imp+7),"=C"+str(imp+5)+"/C"+str(imp+7),"=C"+str(imp+6)+"/C"+str(imp+7),"=C"+str(imp+7)+"/C"+str(imp+7)
            iws["B"+str(imp+3)].fill,iws["C"+str(imp+3)].fill,iws["D"+str(imp+3)].fill,iws["B"+str(imp+4)].fill,iws["B"+str(imp+5)].fill,iws["B"+str(imp+6)].fill,iws["B"+str(imp+7)].fill=fill_LightGreen,fill_LightGreen,fill_LightGreen,fill_LightGreen,fill_LightGreen,fill_LightGreen,fill_LightGreen
            for i in range(3,8):
                for j in range(2,5):
                    iws.cell(row=imp+3,column=j).font=black_bold
                    iws.cell(row=imp+i,column=j).border=thin_border
            for i in range(4,8):
                iws["D"+str(imp+i)].number_format="0.0%"
            if "OCP" in cdir:
                iws["E1"],iws["X1"],iws["T1"],iws["AA1"]="OCP",OCPlevel.get(iws["P1"].value),OCPsexdict.get(iws["P1"].value),OCPjobdict.get(iws["P1"].value)
                for tn in OCPTeamlst:
                    if tn in cdir:
                        iws["H1"],iws["L1"]=tn,partname
                    if "QA(compliance)" or "QA(Compliance)" in cdir: #QA(compliance)가 팀명이 QA로 넣어지는 것을 방지.
                        iws["H1"]="QA(compliance)"
            elif "HSP" in cdir:
                iws["E1"],iws["X1"],iws["T1"],iws["AA1"]="HSP",HSPlevel.get(iws["P1"].value),HSPsexdict.get(iws["P1"].value),HSPjobdict.get(iws["P1"].value)
                for tn in OCPTeamlst:
                    if tn in cdir:
                        iws["H1"],iws["L1"]=tn,partname
            elif "ESP" in cdir:
                iws["E1"],iws["X1"],iws["T1"],iws["AA1"]="ESP",ESPlevel.get(iws["P1"].value),ESPsexdict.get(iws["P1"].value),ESPjobdict.get(iws["P1"].value)
                for tn in OCPTeamlst:
                    if tn in cdir:
                        iws["H1"],iws["L1"]=tn,partname
            partjobdict=dict()
            for pln in Plantlst: #직무별 주작업 받아오기
                if pln in cdir:
                    pws=rwb[pln]
                    r,c=8,4
                    while pws.cell(row=8,column=c).value!=None:
                        if iws["AA1"].value==pws.cell(row=8,column=c).value: #AA1셀에 있는 주작업이 주작업 리스트(행)에 있으면 그 이후로 아래로 내려가서 주작업을 딕셔너리로 받아옴
                            while r+1 <= 57:
                                if pws.cell(row=r+1,column=c).value!=None:
                                    partjobdict[pws.cell(row=r+1,column=3).value]=partjobdict.get(pws.cell(row=r+1,column=3).value,"주작업")
                                r+=1
                        c+=1
            iws.merge_cells("F1:G1"),iws.merge_cells("H1:I1"),iws.merge_cells("J1:K1"),iws.merge_cells("L1:M1"),iws.merge_cells("N1:O1"),iws.merge_cells("P1:Q1"),iws.merge_cells("R1:S1"),iws.merge_cells("T1:U1"),iws.merge_cells("V1:W1"),iws.merge_cells("X1:Y1"),iws.merge_cells("AA1:AC1")
            chart1,chart2=BarChart(),PieChart() #바 그래프, 파이 그래프
            chart1.type="col" #열 기준
            chart1.style=3 # 스타일 3(스타일 바꾸면 색만 바뀜)
            chart1.title,chart2.title="항목별 시간","항목별 비율" #차트 제목
            cate1=Reference(iws,min_col=2,min_row=imp+4,max_row=imp+6) #카테고리(=범주, 축의 데이터)
            data1,data2=Reference(iws,min_col=3,min_row=imp+3,max_row=imp+6),Reference(iws,min_col=4,min_row=imp+4,max_row=imp+6) #차트 내용 데이터
            chart1.add_data(data1, titles_from_data=True),chart2.add_data(data2) #차트에 데이터 입력(데이터로 부터 데이터 계열 제목 받아옴)
            chart1.set_categories(cate1),chart2.set_categories(cate1) #차트에 축 설정
            #데이터 레이블 설정(데이터 레이블 표시)
            s1,s2=chart1.series[0],chart2.series[0]
            s1.dLbls,s2.dLbls=DataLabelList(),DataLabelList()
            s1.dLbls.showVal,s2.dLbls.showVal=True,True
            chart1.legend.position,chart2.legend.position="b","b" #범례 위치 아래쪽에
            for i in range(3,imp):
                iws["E"+str(i)]=partjobdict.get(iws["B"+str(i)].value)
                if iws["C"+str(i)].value=="휴식" or iws["C"+str(i)].value=="휴가" or iws["C"+str(i)].value=="점심시간":
                    iws["E"+str(i)]="작업여유"
                elif iws["E"+str(i)].value==None:
                    iws["E"+str(i)]="부수작업"
                iws["E"+str(i)].fill=fill_LightYellow
            iws.add_chart(chart1, "F"+str(imp+3)), iws.add_chart(chart2, "R"+str(imp+3)) #F(imp+3)셀에 차트 삽입
            dv=DataValidation(type="list", formula1='"주작업,부수작업,작업여유"') #반드시 '" 순서로 써줘야함. 엑셀은 "를 텍스트로 인식.
            iws.add_data_validation(dv)
            dv.add("E3:E"+str(imp-1))
            iws.sheet_view.zoomScale=75
            iws.column_dimensions["A"].width,iws.column_dimensions["E"].width=2,23
            for i in range(1,imp+8):
                iws.row_dimensions[i].height=23
            for cells in iws["B1:AC"+str(imp+7)]: #모든 범위 글자 가운데 정렬
                for cell in cells:
                    cell.alignment=centered_A
            for cells in iws["F3:Z"+str(imp)]:
                for cell in cells:
                    cell.number_format="#,##0"
        wb.save(str(files))
